<a href="https://colab.research.google.com/github/Mgobeaalcoba/Full_Pandas/blob/main/datatypes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.3.4'

In [3]:
!pip install --upgrade pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Collecting pandas
  Downloading pandas-1.3.4-cp37-cp37m-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.3 MB)
     |████████████████████████████████| 11.3 MB 4.1 MB/s
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pandas
  Attempting uninstall: pandas
    Found existing installation: pandas 1.1.5
    Uninstalling pandas-1.1.5:
      Successfully uninstalled pandas-1.1.5
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
google-colab 1.0.0 requires pandas~=1.1.0; python_version >= "3.0", but you have pandas 1.3.4 which is incompatible.
Successfully installed pandas-1.3.4

In [3]:
dir_pandas = '/content/drive/My Drive/Colab Notebooks/db/{}'
dir_pandas

'/content/drive/My Drive/Colab Notebooks/db/{}'

**Muy importante: Antes de leer el archivo debo conectar mi colab con mi google drive**

In [7]:
from google.colab import drive # Codigo para poder acceder al contenido de nuestro google drive
drive.mount("/content/drive")

Mounted at /content/drive

In [11]:
df_meteorites = pd.read_csv(dir_pandas.format("Meteorite_Landings.csv"))
df_meteorites

             name     id nametype  ...    reclat    reclong             GeoLocation
0          Aachen      1    Valid  ...  50.77500    6.08333       (50.775, 6.08333)
1          Aarhus      2    Valid  ...  56.18333   10.23333    (56.18333, 10.23333)
2            Abee      6    Valid  ...  54.21667 -113.00000      (54.21667, -113.0)
3        Acapulco     10    Valid  ...  16.88333  -99.90000       (16.88333, -99.9)
4         Achiras    370    Valid  ... -33.16667  -64.95000     (-33.16667, -64.95)
...           ...    ...      ...  ...       ...        ...                     ...
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[45716 rows x 10 columns]

In [12]:
df_meteorites.head()

       name   id nametype  ...    reclat    reclong           GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775, 6.08333)
1    Aarhus    2    Valid  ...  56.18333   10.23333  (56.18333, 10.23333)
2      Abee    6    Valid  ...  54.21667 -113.00000    (54.21667, -113.0)
3  Acapulco   10    Valid  ...  16.88333  -99.90000     (16.88333, -99.9)
4   Achiras  370    Valid  ... -33.16667  -64.95000   (-33.16667, -64.95)

[5 rows x 10 columns]

In [16]:
df_meteorites.tail()

             name     id nametype  ...    reclat    reclong             GeoLocation
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[5 rows x 10 columns]

In [17]:
df_meteorites.head(15)

                   name   id  ...    reclong           GeoLocation
0                Aachen    1  ...    6.08333     (50.775, 6.08333)
1                Aarhus    2  ...   10.23333  (56.18333, 10.23333)
2                  Abee    6  ... -113.00000    (54.21667, -113.0)
3              Acapulco   10  ...  -99.90000     (16.88333, -99.9)
4               Achiras  370  ...  -64.95000   (-33.16667, -64.95)
5              Adhi Kot  379  ...   71.80000          (32.1, 71.8)
6   Adzhi-Bogdo (stone)  390  ...   95.16667  (44.83333, 95.16667)
7                  Agen  392  ...    0.61667   (44.21667, 0.61667)
8                Aguada  398  ...  -65.23333    (-31.6, -65.23333)
9         Aguila Blanca  417  ...  -64.55000   (-30.86667, -64.55)
10     Aioun el Atrouss  423  ...   -9.57028  (16.39806, -9.57028)
11                  Aïr  424  ...    8.38333   (19.08333, 8.38333)
12      Aire-sur-la-Lys  425  ...    2.33333   (50.66667, 2.33333)
13                Akaba  426  ...   35.05000     (29.51667, 35.05)
14             Akbarpur  427  ...   77.95000     (29.71667, 77.95)

[15 rows x 10 columns]

In [20]:
df_meteorites.sample(10)

                              name     id  ...     reclong              GeoLocation
35322  Queen Alexandra Range 99694  22140  ...  168.000000           (-84.0, 168.0)
40833                Yamato 791632  26981  ...   35.666670        (-71.5, 35.66667)
32475  Queen Alexandra Range 93220  19309  ...  162.084760   (-84.57641, 162.08476)
15351       Grove Mountains 052527  48334  ...   75.296667  (-72.786389, 75.296667)
5099           Biduna Blowhole 002  54929  ...  131.285470   (-31.03297, 131.28547)
44390                Yamato 982042  38664  ...    0.000000               (0.0, 0.0)
22996       Meteorite Hills 001042  15538  ...  159.750000      (-79.68333, 159.75)
7204                   Dhofar 1401  35491  ...   54.655450     (19.19135, 54.65545)
14661       Grove Mountains 023152  48086  ...   75.338889     (-72.775, 75.338889)
21210            Lewis Cliff 88484  14228  ...  161.401060   (-84.24814, 161.40106)

[10 rows x 10 columns]

In [21]:
df_meteorites.describe() # Me muestra medidas de tendencia central de mis variables estadisticas

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

In [25]:
df_meteorites.size # Me muestra la cantidad total de registros de mi database

457160

In [26]:
df_meteorites.shape # Me muestra filas por columnas

(45716, 10)

**Para poder ver el .describe sin notación cientifica podemos correr el siguiente codigo: **

In [29]:
pd.options.display.float_format="{:,.1f}".format # Significa que quiero comas para separar las unidades de mil y 1 solo decimal luego del punto.

In [30]:
df_meteorites.describe()

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

In [32]:
df_meteorites.describe(include="all") # Me muestra ademas de la medidas de tendencia central información de mis variables tipo texto.

          name       id nametype  ...   reclat  reclong GeoLocation
count    45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique   45716      NaN        2  ...      NaN      NaN       17100
top     Aachen      NaN    Valid  ...      NaN      NaN  (0.0, 0.0)
freq         1      NaN    45641  ...      NaN      NaN        6214
mean       NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std        NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min        NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%        NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%        NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%        NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max        NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

In [34]:
df_meteorites.info() # Me muestra de que tipo son mis variables. Veo los strings como objects

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [36]:
df_meteorites.convert_dtypes().dtypes # Con este comando veo mis strings como strings

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year            string
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object